# التكليف 04
# هذا التكليف يفيدك في تطوير مستواك في إستخدام ال Methods
# داخل بعضها وفصل العمليات الحسابية وإستخدام الأقواس بشكل سليم ومنظم
# قم بإنشاء متغير باسم num_one والقيمة الخاصة به هي رقم 10
# قم بإنشاء متغير بإسم num_two والقيمة الخاصة به هي رقم 20
# قم بتخزين نتيجة جمع المتغيريين في متغير جديد بإسم result وقم بطباعته في السطر الأول
# في السطر الثاني قم بإيجاد نتيجة رفع الرقم لل Exponent 3
# في السطر الثالث قم بإيجاد باقي قسمة الرقم الناتج من الطلب السابق على 26000
# في السطر الرابع قم بطباعة نتيجة قسمة الرقم الناتج على 5
# تأكد أن الرقم السابق عبارة عن Float لتعرف أنك وصلت للحل بشكل سليم
# في السطر الخامس قم بطباعة النوع بعد تحويله ل String للتأكد من أنه String
num_one = 10
num_two = 20

# Needed Output

# 30
# 27000
# 1000
# 200.0
# <class 'str'>

result = num_one + num_two
print(result)

result_1 = result ** 3
print(pow(result, 3))
print(result_1)

result_2 = result_1 % 2600
print(result_2)

result_3 = (result_2 // 5)
print(result_3)

int(result_3)
print(type(result_3))